FSI/fsi3/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          25224;
        startFace       49940;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          25224;
        startFace       75164;
    }
    inlet
    {
        type            patch;
        nFaces          88;
        startFace       100388;
    }
    outlet
    {
        type            patch;
        nFaces          94;
        startFace       100476;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       100570;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       100828;
    }
    flap
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       101086;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          138;
        startFace       101266;
    }
)

// ************************************************************************* //
